# Minimal Brewfile

# Tap
# -----------------------------------------------------------------------------
tap "buo/cask-upgrade" # 3rd party brew package updater
tap "homebrew/command-not-found" # Missing package suggestor
tap "homebrew/core" # Core forumulaa for homebrew

# Brew
# -----------------------------------------------------------------------------
brew "ack"
brew "bash"
brew "bat"
brew "bind"
brew "brew-pip"
brew "cabal-install"
brew "cask"
brew "coreutils"
brew "curl"
brew "exa"
brew "fd"
brew "fd"
brew "fortune"
brew "fzf"
brew "fzy"
brew "gawk"
brew "git"
brew "glide"
brew "grc"
brew "grv"
brew "htop"
brew "hub"
brew "jq"
brew "lua"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "p7zip"
brew "packer"
brew "perl"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "pyenv"
brew "python"
brew "python@2"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "telnet"
brew "terraform", link: false
brew "tfenv"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "thefuck"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "wget"
brew "zip"
brew "zsh-completions"
brew "zsh"

# cask
# -----------------------------------------------------------------------------
cask "caffeine"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "slack"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
