# -*- mode: ruby -*-
# Minimal Brewfile

tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"

brew "ack"
brew "aircrack-ng"
brew "bash"
brew "bat"
brew "bind"
brew "brew-pip"
brew "cabal-install"
brew "cask"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "ed"
brew "exa"
brew "fd"
brew "fontconfig"
brew "fontforge"
brew "fortune"
brew "fzf"
brew "fzy"
brew "gawk"
brew "git"
brew "glide"
brew "go"
brew "grc"
brew "grv"
brew "haskell-stack"
brew "htop"
brew "hub"
brew "iproute2mac"
brew "jq"
brew "keychain"
brew "lastpass-cli"
brew "legit"
brew "lua"
brew "luarocks"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "node"
brew "nvm"
brew "openconnect"
brew "p7zip"
brew "pandoc"
brew "pass"
brew "peco"
brew "perl"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python"
brew "python@2"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "thefuck"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zip"
brew "zsh"
brew "zsh-completions"

# -----------------------------------------------------------------------------
# Cask Packages
# -----------------------------------------------------------------------------

cask "caffeine"
cask "cyberduck"
cask "discord"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "slack"
cask "suspicious-package"
cask "the-unarchiver"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "webpquicklook"
