autojump
wallix/awless/awless
aws-shell
awscli
luzifer/tools/awsenv
bash-completion
bashdb
brew-cask-completion
cli53
coreutils
curl
elb-tools
exercism
fasd
findutils
fontconfig
fortune
fzf
jhawthorn/fzy/fzy
git
git-extras
gnu-sed
grc
grep
highlight
hub
ipcalc
jmespath/jmespath/jp
jq
lesspipe
macvim
maven
moreutils
mysql
neovim/neovim/neovim
nmap
node
nvm
pcre2
peco
python
python3
reattach-to-user-namespace
texi2html
the_silver_searcher
tig
tmux
tree
wget
xonsh
yaws
z
zsh
zsh-completions
zsh-git-prompt
zsh-history-substring-search
zsh-lovers
zsh-navigation-tools
zsh-syntax-highlighting

