tap "homebrew/bundle"
tap "homebrew/core"

brew "ack"
brew "ansible"
brew "bat"
brew "bind"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fortune"
brew "fx"
brew "fzf"
brew "fzy"
brew "git"
brew "git-extras"
brew "git-now"
brew "git-open"
brew "git-quick-stats"
brew "git-recent"
brew "howdoi"
brew "htop"
brew "hub"
brew "jq"
brew "lua"
brew "molecule"
brew "neovim"
brew "nmap"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "terraform"
brew "tfenv"
brew "tflint"
brew "the_platinum_searcher"
brew "thefuck"
brew "tmux"
brew "tree"
brew "wget"
brew "zip"
brew "zsh"

