# -*- mode: ruby -*-
# Minimal Brewfile

# -----------------------------------------------------------------------------
# Pre-configuration for brew sources
# -----------------------------------------------------------------------------
#
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'railwaycat/emacsmacport'

# -----------------------------------------------------------------------------
# Brew Packages
# -----------------------------------------------------------------------------

brew "ack"
brew "aircrack-ng"
brew "ansible"
brew "bash"
brew "bat"
brew "bind"
brew "brew-pip"
brew "cabal-install"
brew "cask"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "exa"
brew "fd"
brew "fontconfig"
brew "fortune"
brew "fzf"
brew "fzy"
brew "git-extras"
brew "glide"
brew "go"
brew "grv"
brew "haskell-stack"
brew "htop"
brew "hub"
brew "jq"
brew "lastpass-cli"
brew "legit"
brew "lua"
brew "luarocks"
brew "node"
brew "npm"
brew "nvm"
brew "openconnect"
brew "p7zip"
brew "pandoc"
brew "pass"
brew "peco"
brew "perl"
brew "pyenv"
brew "python"
brew "python@2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-navigation-tools"

# -----------------------------------------------------------------------------
# Cask Packages
# -----------------------------------------------------------------------------

brew "font-ibm-plex"
cask "caffeine"
cask "cyberduck"
cask "discord"
cask "firefox"
cask "slack"
cask "the-unarchiver"
cask "transmission"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "visual-studio-code"
