tap "doron-cohen/tap"
tap "homebrew/bundle"
brew "brew-cask-completion"
brew "cmake"
brew "eza"
brew "fnm"
brew "fontforge"
brew "node"
brew "ronn"
brew "tmux"
brew "tre"
brew "tree"
brew "zinit"
brew "zsh-completions"
brew "doron-cohen/tap/antidot"
cask "apparency"
cask "brewlet"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "visual-studio-code"
vscode "48exa.one-quiet-dark-pro-custom-italics"
vscode "aaron-bond.better-comments"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "adisreyaj.sonarqube-status"
vscode "ahmedafolayan.codeslinter"
vscode "alefragnani.project-manager"
vscode "alexnho.a-touch-of-lilac-theme"
vscode "anjali.clipboard-history"
vscode "annsk.alignment"
vscode "arturodent.custom-language-syntax"
vscode "arzg.intellij-theme"
vscode "atishay-jain.all-autocomplete"
vscode "bmalehorn.shell-syntax"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "bsides.snazzy-operator-plus"
vscode "ceciljacob.code-plus-theme"
vscode "chiragpat.tomorrow-and-tomorrow-night-operator-mono-theme"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "cmckni3.dark-plus-mono"
vscode "codezombiech.gitignore"
vscode "compulim.compulim-vscode-closetag"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "dinhani.copy-on-select"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dotjoshjohnson.xml"
vscode "dual.zsh-completion-script"
vscode "duniul.dircolors"
vscode "dunstontc.vscode-gitignore-syntax"
vscode "earshinov.simple-alignment"
vscode "editorconfig.editorconfig"
vscode "edwinkofler.vscode-assorted-languages"
vscode "ekeel.groovy-beautify"
vscode "ekeelgithubactionspublisher.jenkins-declarative-linter"
vscode "eliverlara.andromeda"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "exiasr.hadolint"
vscode "fab1o.dark-plus-with-italics"
vscode "fabianlauer.vs-code-xml-format"
vscode "fallenwood.syntax-highlighter-ng"
vscode "florianduros.theme-dracula-italics-turbo"
vscode "fnando.linter"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "genieai.chatgpt-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitkendra.hop-light-with-italics"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.open-url"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "henriiik.docker-linter"
vscode "herrherklotz.url-preview"
vscode "hoovercj.vscode-settings-cycler"
vscode "huizhou.githd"
vscode "iamkd.one-monokai-italics"
vscode "ibm.output-colorizer"
vscode "idbartosz.darkpp-italic"
vscode "ionutvmi.path-autocomplete"
vscode "irongeek.vscode-env"
vscode "ivory-lab.jenkinsfile-support"
vscode "jabacchetta.vscode-essentials"
vscode "jakearl.search-editor-apply-changes"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jca02266.align-columns"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "johnpapa.vscode-peacock"
vscode "joshdales.taiga-theme"
vscode "jprestidge.theme-material-theme"
vscode "jsjlewis96.one-dark-pro-italic-vivid"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "l13rary.l13-sh-snippets"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "lefede.columnize"
vscode "lior-chamla.google-fonts"
vscode "liviuschera.noctis"
vscode "lmcarreiro.vscode-smart-column-indenter"
vscode "mads-hartmann.bash-ide-vscode"
vscode "malmaud.tmux"
vscode "marlon407.code-groovy"
vscode "mashcodee.url-highlighter"
vscode "matthewthorning.align-vertically"
vscode "mattn.lisp"
vscode "mblode.pretty-formatter"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mellowmarshmallow.groovy"
vscode "meronz.manpages"
vscode "metaseed.metago"
vscode "metaseed.metaword"
vscode "mgtrrz.terraform-completer"
vscode "micnil.vscode-checkpoints"
vscode "miguelsolorio.fluent-icons"
vscode "mikeburgh.xml-format"
vscode "mkhl.shfmt"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "nathanridley.autotrim"
vscode "natqe.reload"
vscode "nhoizey.gremlins"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "parthr2031.colorful-comments"
vscode "pkief.material-icon-theme"
vscode "pleiades.java-extension-pack-jdk"
vscode "pnp.polacode"
vscode "pod212.vscode-github-projects"
vscode "prateekmahendrakar.prettyxml"
vscode "quicktype.quicktype"
vscode "recode4dev.jenkinsfile"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rodrigosuelli.illusion-refined"
vscode "rogalmic.bash-debug"
vscode "rogalmic.vscode-xml-complete"
vscode "rogalmic.zsh-debug"
vscode "rpinski.shebang-snippets"
vscode "rubjo.ultimate-dark-neo"
vscode "ryu1kn.edit-with-shell"
vscode "ryu1kn.partial-diff"
vscode "sagaban.dark-gruvbox-with-italics"
vscode "samuelcolvin.jinjahtml"
vscode "searking.preview-vscode"
vscode "secanis.jenkinsfile-support"
vscode "seyyedkhandon.firacode"
vscode "shakram02.bash-beautify"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shunqian.prettier-plus"
vscode "sidneys1.gitconfig"
vscode "slevesque.vscode-zipexplorer"
vscode "spixooze.oozedarktheme"
vscode "stephlin.vscode-tmux-keybinding"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "sum-packer.shell-extension-summary"
vscode "svipas.control-snippets"
vscode "svipas.prettier-plus"
vscode "tabnine.tabnine-vscode"
vscode "talhabalaj.actual-font-changer"
vscode "tetradresearch.vscode-h2o"
vscode "therealbhuvi.spurlys-theme"
vscode "thompsonbrian.improved-minimal-theme"
vscode "thudgin13.barbie-rave"
vscode "thudgin13.neon-party-lights"
vscode "timonwong.shellcheck"
vscode "tomasvergara.vscode-fontawesome-gallery"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tombyrer.nord-city-theme"
vscode "tomoki1207.pdf"
vscode "truman.autocomplate-shell"
vscode "tygooch.autoclose-find"
vscode "ulasozguler.url-utils"
vscode "usernamehw.errorlens"
vscode "utocode.jenkinssuite"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.gistfs"
vscode "wekex.jsonlint"
vscode "wholroyd.jinja"
vscode "woozy-masta.shell-script-ide"
vscode "xadillax.viml"
vscode "xiejiangzhi.linter-xjz"
vscode "xshrim.txt-syntax"
vscode "yoshinorin.current-file-path"
vscode "yy0931.gitconfig-lsp"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zfzackfrost.commentbars"
vscode "zhuangtongfa.material-theme"
