tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bat"
brew "cdrtools"
brew "exa"
brew "fd"
brew "fortune"
brew "fzf"
brew "fzy"
brew "gawk"
brew "lua"
brew "neovim"
brew "nmap"
brew "packer"
brew "python"
brew "python@2"
brew "ripgrep"
brew "shfmt"
brew "telnet"
brew "terraform", link: false
brew "tfenv"
brew "tree"
brew "vault"
brew "wget"
brew "zsh"
cask "1password-cli"
cask "vagrant"
